import { Text } from '@chakra-ui/react'

const AboutMe = () => {
  return (
    <Text>
      אודותי
      <p>
        כשאני נשאלת במה אני עוסקת למחייתי, יש לי תשובה קבועה: אנשים זקנים, זו ה"אהבה" שלי. לשמחתי, יש לי את הזכות לעסוק
        במה שאני אוהבת.
      </p>
      <p>
        שמי מוריה מנור-גנים, בעלת תואר שני בעבודה סוציאלית בהתמחות בזקנה, בריאות ושיקום מאוניברסיטת בר אילן. אני בוגרת
        תכנית לימודי "בריאות נפשית בזקנה" מאוניברסיטת ברקלי, קליפורניה במסגרתה צברתי ידע ומומחיות בתחומים נפוצים בשלב זה
        של החיים, בהם: מצבי בריאות יחודיים לזקנה, ירידה קוגנטיבית ודמנציה, התמודדות עם אבל ואבדן, עבודה עם משפחות ושלבי
        טיפול יחודיים בסוף החיים.
      </p>
      <p>
        אני בוגרת התוכנית ללימודי לוגותרפיה - תרפיה באמצעות מתן משמעות, שיוסדה על ידי פרופ' ויקטור פראנקל (מחבר ספר
        המופת "האדם מחפש משמעות"). כמו כן אני העובדת סוציאלית של הקליניקה לזכויות זקנים וניצולי שואה באוניברסיטת בר אילן
        ומנחה סטודנטים בנושאי מתן סיוע וייצוג משפטי לאנשים בגיל הזקנה.
      </p>
      <p>
        במשך שנים רבות בהן עבדתי במסגרות דיור שונות (בית אבות/דיור מוגן) היתה לי הזכות ללוות מקרוב מאות מבני הגיל השלישי
        אשר התמודדו עם אתגרי הגיל ואפשרו לי להיות שם עבורם, לרפד את "המכה" ולהקל על קושי, דרך החיבור האנושי המיוחד
        שרקמנו יחד.
      </p>
      <p>
        מאחורי כמעט כל אדם מזדקן, ניצבת משפחה אשר באמצע שגרת החיים האינטנסיבית (גידול ילדים, נכדים, עבודה ועוד) פוגשת
        באתגרים ובסימני שאלה רבים סביב תהליך ההזדקנות או משבר שחווה ההורה. ה"סבך הבירוקרטי" עשוי להיות מתיש ומייסר
        ומצריך הצטרפות אל "תכנית לימודים חדשה", אליה רובנו לא נרשמנו.
      </p>
      <p>
        ביודעי עד כמה המצב עשוי להיות רגיש ומורכב, וכן עד כמה אנשים כלל לא מודעים לזכויותיהם ולאפשרויות העומדות בפניהם –
        אני מציעה את שירותיי בקליניקה או בבית האדם/משפחתו. אשמח לעמוד לצידכם במסע המשפחתי והאישי ולהאיר עבורכם את הדרך.
      </p>
    </Text>
  )
}

export default AboutMe
